doc/uml/puml/vccycle-components-connector.puml
class VCCycle {
       + name:str 
       + refrigerant:str
       + comps : dict cycle 
       + conns: Connector
       + Qin : float 
       + Qout : float 
       + Wc : float
       + cop : float
       + cop_hp : float
       + {static} VCCycle(dictcycle:dict)
       - component_simulator() 
       + simulator() 
       + __str__():str
 }
VCCycle "1" *-[#blue]- "1" Connector 
VCCycle "1" o-- "1..*" Compressor 
VCCycle "1" o-- "1..*" Condenser
VCCycle "1" o-- "1..*" Evaporator
VCCycle "1" o-- "1..*" ExpansionValve
